import { ICommendCardData } from '@/app/components/CommentCard/CommentCard.types'
import user_one from '../../../public/users_comment/user_1.png'
import user_two from '../../../public/users_comment/user_2.png'
import user_three from '../../../public/users_comment/user_3.png'

export const comments: ICommendCardData[] = [
  {
    id: 1,
    text: 'Компьютер привезли быстро, работает отлично, к девайсам нареканий нет. Отличный сервис, давно ждал такого в нашем городе. Все чистое и почти новое.',
    name: 'Олег Петров',
    date: '12.01.2023 г.',
    userAvatar: user_one,
  },
  {
    id: 2,
    text: 'Доставили на служебном автомобиле, помогли с установкой. Стандартный ПК в играх показывает себя отлично. Dota 2 стабильные 120 fps.',
    name: 'Дима Трунов',
    date: '24.03.2023 г.',
    userAvatar: user_two,
  },
  {
    id: 3,
    text: 'Премиальный ПК, работает тихо, не греется. В играх показывает 200 и более fps. Очень доволен серисом. Очень удобно. Не приходится слушать крики школьников в клубе.',
    name: 'Саша Белов',
    date: '24.03.2023 г.',
    userAvatar: user_three,
  },
  {
    id: 4,
    text: 'Компьютер привезли быстро, работает отлично, к девайсам нареканий нет. Отличный сервис, давно ждал такого в нашем городе. Все чистое и почти новое.',
    name: 'Олег Петров',
    date: '12.01.2023 г.',
    userAvatar: user_one,
  },
  {
    id: 5,
    text: 'Доставили на служебном автомобиле, помогли с установкой. Стандартный ПК в играх показывает себя отлично. Dota 2 стабильные 120 fps.',
    name: 'Дима Трунов',
    date: '24.03.2023 г.',
    userAvatar: user_two,
  },
  {
    id: 6,
    text: 'Премиальный ПК, работает тихо, не греется. В играх показывает 200 и более fps. Очень доволен серисом. Очень удобно. Не приходится слушать крики школьников в клубе.',
    name: 'Саша Белов',
    date: '24.03.2023 г.',
    userAvatar: user_three,
  },
  {
    id: 7,
    text: 'Компьютер привезли быстро, работает отлично, к девайсам нареканий нет. Отличный сервис, давно ждал такого в нашем городе. Все чистое и почти новое.',
    name: 'Олег Петров',
    date: '12.01.2023 г.',
    userAvatar: user_one,
  },
  {
    id: 8,
    text: 'Доставили на служебном автомобиле, помогли с установкой. Стандартный ПК в играх показывает себя отлично. Dota 2 стабильные 120 fps.',
    name: 'Дима Трунов',
    date: '24.03.2023 г.',
    userAvatar: user_two,
  },
  {
    id: 9,
    text: 'Премиальный ПК, работает тихо, не греется. В играх показывает 200 и более fps. Очень доволен серисом. Очень удобно. Не приходится слушать крики школьников в клубе.',
    name: 'Саша Белов',
    date: '24.03.2023 г.',
    userAvatar: user_three,
  },
]
